Revit 2024 API
RibbonItemData.Name Property
The name of the item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string Name { get; set; }
Visual Basic
Public Property Name As String
	Get
	Set
Visual C++
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException | Thrown when setting the value to null.
Autodesk.Revit.Exceptions.ArgumentException | Thrown when setting the value to an empty string.
See Also
RibbonItemData Class
Autodesk.Revit.UI Namespace